АлогистикТест2/src/Documents/алк_ВводНачальныхОстатковОтходы/алк_ВводНачальныхОстатковОтходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ВводНачальныхОстатковОтходы</name>
  <registerRecords>AccumulationRegister.алк_Отходы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_ВводНачальныхОстатковОтходы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаВводОстатковОтходы, СтруктураДополнительныеСвойства) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ВводНачальныхОстатковОтходыЗапасы.Ссылка.Организация,
		|	алк_ВводНачальныхОстатковОтходыЗапасы.Номенклатура,
		|	алк_ВводНачальныхОстатковОтходыЗапасы.Характеристика,
		|	алк_ВводНачальныхОстатковОтходыЗапасы.Объем,
		|	&ВидДвиженияНакопления КАК ВидДвижения,
		|	&Период,
		|	алк_ВводНачальныхОстатковОтходыЗапасы.Ссылка.ДатаСмены,
		|	алк_ВводНачальныхОстатковОтходыЗапасы.Ссылка.Смена
		|ИЗ
		|	Документ.алк_ВводНачальныхОстатковОтходы.Запасы КАК алк_ВводНачальныхОстатковОтходыЗапасы
		|ГДЕ
		|	алк_ВводНачальныхОстатковОтходыЗапасы.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("ВидДвиженияНакопления", ВидДвиженияНакопления.Приход);
		Запрос.УстановитьПараметр("Период", ДокументСсылкаВводОстатковОтходы.Дата);
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВводОстатковОтходы);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОтходы", МассивРезультатов[0].Выгрузить());
		
	КонецПроцедуры // ИнициализироватьДанныеДокумента()
	
	#КонецОбласти
	
#КонецЕсли
